In [1]:
import pandas as pd
from sqlalchemy import create_engine

You cannot use `engine.execute()`, because postgres does not allow you to create/delete databases inside transactions, and sqlalchemy always tries to run queries in a transaction. To get around this, get the underlying connection from the engine:

In [2]:
def drop_db():
    # if you don't specify database name, then by default db name = username
    engine = create_engine('postgresql://root:root@localhost:5432/')
    connection = engine.connect()
    try:
        connection.execute('commit')
        connection.execute('DROP DATABASE IF EXISTS datacamp_countries')
        connection.execute('commit')
        
        # PostgreSQL does not support create if not exists syntax.
        connection.execute('CREATE DATABASE datacamp_countries')
    except Exception:
        print('Something went wrong')
    finally:
        connection.close()


drop_db()

In [3]:
!cd datasets/countries; psql postgresql://root:root@localhost:5432/datacamp_countries < ./countries.sql

CREATE TABLE
CREATE TABLE
CREATE TABLE
CREATE TABLE
CREATE TABLE
CREATE TABLE
CREATE TABLE
CREATE TABLE
CREATE TABLE
COPY 236
COPY 206
COPY 955
COPY 380
COPY 190
COPY 190
COPY 224
COPY 434
COPY 206

In [4]:
engine = create_engine('postgresql://root:root@localhost:5432/datacamp_countries')

In [5]:
print(engine.table_names())

['cities', 'countries', 'languages', 'economies', 'currencies', 'populations', 'countries_plus', 'economies2010', 'economies2015']

In [6]:
%load_ext sql
%sql postgresql://root:root@localhost:5432/datacamp_countries

# ipython-sql
* https://towardsdatascience.com/how-to-run-sql-queries-from-a-jupyter-notebook-aaa18e59e7bc
* [Highlight SQL syntax](https://stackoverflow.com/questions/57966403/how-to-add-syntax-highlight-to-sql-line-magic-cell-magic-and-custom-command-in)

The following code works for SQL when placed in ~/.jupyter/custom/custom.js with notebook 5.x:
```javascript
require(['notebook/js/codecell'], function(codecell) {
  codecell.CodeCell.options_default.highlight_modes['magic_text/x-mssql'] = {'reg':[/^%%sql/]} ;
  Jupyter.notebook.events.one('kernel_ready.Kernel', function(){
  Jupyter.notebook.get_cells().map(function(cell){
      if (cell.cell_type == 'code'){ cell.auto_highlight(); } }) ;
  });
});
```

# Joining data in PostgreSQL

In [7]:
%%sql 
SELECT * FROM populations LIMIT 10;

 * postgresql://root:***@localhost:5432/datacamp_countries
10 rows affected.

[(20, 'ABW', 2010, 1.704, 74.9535, 101597.0),
 (19, 'ABW', 2015, 1.647, 75.5736, 103889.0),
 (2, 'AFG', 2010, 5.746, 58.9708, 27962200.0),
 (1, 'AFG', 2015, 4.653, 60.7172, 32526600.0),
 (12, 'AGO', 2010, 6.416, 50.6542, 21220000.0),
 (11, 'AGO', 2015, 5.996, 52.6661, 25022000.0),
 (4, 'ALB', 2010, 1.663, 77.0369, 2913020.0),
 (3, 'ALB', 2015, 1.793, 78.0145, 2889170.0),
 (10, 'AND', 2010, 1.27, None, 84419.0),
 (9, 'AND', 2015, None, None, 70473.0)]

## Self-join

In [8]:
pd.read_sql("""
SELECT DISTINCT year FROM populations
""", engine)

   year
0  2015
1  2010

In [9]:
%%sql
SELECT p1.country_code,
       p1.size AS size2010,
       p2.size AS size2015
FROM populations AS p1
  INNER JOIN populations AS p2
    ON p1.country_code = p2.country_code
LIMIT 12

-- Self join to compare population of a country in 2010 and in 2015
-- note, that for each country you have 4 rows: (2010, 2010), (2010, 2015), (2015, 2010), (2015, 2015);
-- But we care only about (2010, 2015) result

 * postgresql://root:***@localhost:5432/datacamp_countries
12 rows affected.

[('ABW', 101597.0, 103889.0),
 ('ABW', 101597.0, 101597.0),
 ('ABW', 103889.0, 103889.0),
 ('ABW', 103889.0, 101597.0),
 ('AFG', 27962200.0, 32526600.0),
 ('AFG', 27962200.0, 27962200.0),
 ('AFG', 32526600.0, 32526600.0),
 ('AFG', 32526600.0, 27962200.0),
 ('AGO', 21220000.0, 25022000.0),
 ('AGO', 21220000.0, 21220000.0),
 ('AGO', 25022000.0, 25022000.0),
 ('AGO', 25022000.0, 21220000.0)]

In [10]:
%%sql
SELECT p1.country_code,
       p1.size AS size2010,
       p2.size AS size2015
FROM populations AS p1
  INNER JOIN populations AS p2
    ON p1.country_code = p2.country_code
        AND p1.year = p2.year - 5
LIMIT 10

-- Self join to compare population of a country in 2010 and in 2015 WITHOUT duplicates

 * postgresql://root:***@localhost:5432/datacamp_countries
10 rows affected.

[('ABW', 101597.0, 103889.0),
 ('AFG', 27962200.0, 32526600.0),
 ('AGO', 21220000.0, 25022000.0),
 ('ALB', 2913020.0, 2889170.0),
 ('AND', 84419.0, 70473.0),
 ('ARE', 8329450.0, 9156960.0),
 ('ARG', 41222900.0, 43416800.0),
 ('ARM', 2963500.0, 3017710.0),
 ('ASM', 55636.0, 55538.0),
 ('ATG', 87233.0, 91818.0)]

In [11]:
%%sql
SELECT p1.country_code,
       p1.size AS size2010, 
       p2.size AS size2015,
       ((p2.size - p1.size)/p1.size * 100.0) AS growth_perc
FROM populations AS p1
  INNER JOIN populations AS p2
    ON p1.country_code = p2.country_code
        AND p1.year = p2.year - 5
LIMIT 10

-- Let's calculate growth percentage

 * postgresql://root:***@localhost:5432/datacamp_countries
10 rows affected.

[('ABW', 101597.0, 103889.0, 2.25597210228443),
 ('AFG', 27962200.0, 32526600.0, 16.32329672575),
 ('AGO', 21220000.0, 25022000.0, 17.9171919822693),
 ('ALB', 2913020.0, 2889170.0, -0.818874966353178),
 ('AND', 84419.0, 70473.0, -16.5199771523476),
 ('ARE', 8329450.0, 9156960.0, 9.93474572896957),
 ('ARG', 41222900.0, 43416800.0, 5.32199628651142),
 ('ARM', 2963500.0, 3017710.0, 1.8294608220458),
 ('ASM', 55636.0, 55538.0, -0.176144938450307),
 ('ATG', 87233.0, 91818.0, 5.25603853166103)]

## INTO

In [12]:
%%sql
SELECT country_code, size,
  CASE WHEN size > 50000000
            THEN 'large'
       WHEN size > 1000000
            THEN 'medium'
       ELSE 'small' 
  END AS popsize_group
INTO pop_plus       
FROM populations
WHERE year = 2015;

-- INTO - safes data into a table

 * postgresql://root:***@localhost:5432/datacamp_countries
217 rows affected.
(psycopg2.ProgrammingError) can't execute an empty query
[SQL: -- INTO - safes data into a table]
(Background on this error at: http://sqlalche.me/e/f405)

In [13]:
%%sql
SELECT * FROM pop_plus LIMIT 10;

 * postgresql://root:***@localhost:5432/datacamp_countries
10 rows affected.

[('ABW', 103889.0, 'small'),
 ('AFG', 32526600.0, 'medium'),
 ('AGO', 25022000.0, 'medium'),
 ('ALB', 2889170.0, 'medium'),
 ('AND', 70473.0, 'small'),
 ('ARE', 9156960.0, 'medium'),
 ('ARG', 43416800.0, 'medium'),
 ('ARM', 3017710.0, 'medium'),
 ('ASM', 55538.0, 'small'),
 ('ATG', 91818.0, 'small')]

### LEFT vs RIGHT JOIN
![LEFT vs RIGHT JOIN](datasets/LEFTvsRIGHT_JOIN.png)

In [14]:
%%sql
SELECT cities.name AS city, 
       urbanarea_pop, 
       countries.name AS country,
       indep_year, 
       languages.name AS language, 
       percent
FROM cities
  LEFT JOIN countries
    ON cities.country_code = countries.code
  LEFT JOIN languages
    ON countries.code = languages.code
ORDER BY city, language
LIMIT 10; -- might produce not full entities

 * postgresql://root:***@localhost:5432/datacamp_countries
10 rows affected.

[('Abidjan', 4765000.0, "Cote d'Ivoire", 1960, 'French', None),
 ('Abidjan', 4765000.0, "Cote d'Ivoire", 1960, 'Other', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'Arabic', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'English', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'Hindi', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'Persian', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'Urdu', None),
 ('Abuja', 1235880.0, 'Nigeria', 1960, 'English', None),
 ('Abuja', 1235880.0, 'Nigeria', 1960, 'Fulani', None),
 ('Abuja', 1235880.0, 'Nigeria', 1960, 'Hausa', None)]

In [15]:
%%sql
SELECT cities.name AS city, 
       urbanarea_pop, 
       countries.name AS country,
       indep_year, 
       languages.name AS language, 
       percent
FROM languages
  RIGHT JOIN countries
    ON languages.code = countries.code
  RIGHT JOIN cities
    ON countries.code = cities.country_code
ORDER BY city, language
LIMIT 10;

 * postgresql://root:***@localhost:5432/datacamp_countries
10 rows affected.

[('Abidjan', 4765000.0, "Cote d'Ivoire", 1960, 'French', None),
 ('Abidjan', 4765000.0, "Cote d'Ivoire", 1960, 'Other', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'Arabic', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'English', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'Hindi', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'Persian', None),
 ('Abu Dhabi', 1145000.0, 'United Arab Emirates', 1971, 'Urdu', None),
 ('Abuja', 1235880.0, 'Nigeria', 1960, 'English', None),
 ('Abuja', 1235880.0, 'Nigeria', 1960, 'Fulani', None),
 ('Abuja', 1235880.0, 'Nigeria', 1960, 'Hausa', None)]

## FULL JOIN
Combines the result of LEFT and RIGHT joins
![FULL JOIN](./datasets/FULL_JOIN.png)

In [16]:
%%sql
SELECT c1.name AS country, 
       region, 
       l.name AS language,
       basic_unit, 
       frac_unit
FROM countries AS c1
  FULL JOIN languages AS l
    USING (code)
  FULL JOIN currencies AS c2
    USING (code)
WHERE region LIKE 'M%esia'
LIMIT 10;

 * postgresql://root:***@localhost:5432/datacamp_countries
10 rows affected.

[('Kiribati', 'Micronesia', 'English', 'Australian dollar', 'Cent'),
 ('Kiribati', 'Micronesia', 'Kiribati', 'Australian dollar', 'Cent'),
 ('Marshall Islands', 'Micronesia', 'Other', 'United States dollar', 'Cent'),
 ('Marshall Islands', 'Micronesia', 'Marshallese', 'United States dollar', 'Cent'),
 ('Nauru', 'Micronesia', 'Other', 'Australian dollar', 'Cent'),
 ('Nauru', 'Micronesia', 'English', 'Australian dollar', 'Cent'),
 ('Nauru', 'Micronesia', 'Nauruan', 'Australian dollar', 'Cent'),
 ('New Caledonia', 'Melanesia', 'Other', 'CFP franc', 'Centime'),
 ('New Caledonia', 'Melanesia', 'French', 'CFP franc', 'Centime'),
 ('Palau', 'Micronesia', 'Other', 'United States dollar', 'Cent')]

## CROSS JOIN
![CROSS JOIN](datasets/CROSS_JOIN.png)

## SET operations
*black area means that duplicates are counted
![UNION](./datasets/UNION.png)

### UNION

In [17]:
%%sql
SELECT country_code
  FROM cities
UNION
SELECT code AS country_code
  FROM currencies
ORDER BY country_code -- ORDERS united table
LIMIT 5;

 * postgresql://root:***@localhost:5432/datacamp_countries
5 rows affected.

[('ABW',), ('AFG',), ('AGO',), ('AIA',), ('ALB',)]

### INERSECT

In [18]:
%%sql
SELECT code, year
  FROM economies
INTERSECT
SELECT country_code AS code, year
  FROM populations
ORDER BY code, year
LIMIT 5;

 * postgresql://root:***@localhost:5432/datacamp_countries
5 rows affected.

[('AFG', 2010), ('AFG', 2015), ('AGO', 2010), ('AGO', 2015), ('ALB', 2010)]

### EXCEPT
![EXCEPT](datasets/EXCEPT.png)

Get the names of cities in `cities` which are not noted as capital cities in `countries` as a single field result.

In [19]:
%%sql
SELECT name
  FROM cities
EXCEPT
SELECT capital
  FROM countries
LIMIT 5;

 * postgresql://root:***@localhost:5432/datacamp_countries
5 rows affected.

[('Shantou',), ('Surabaya',), ('Recife',), ('Kochi',), ('Faisalabad',)]

Now you will complete the previous query in reverse!
Determine the names of capital cities that are not listed in the `cities` table.

In [20]:
%%sql
SELECT capital
  FROM countries
EXCEPT
SELECT name
  FROM cities
ORDER BY capital -- aliases from the first SELECT are dominant
LIMIT 5;

 * postgresql://root:***@localhost:5432/datacamp_countries
5 rows affected.

[('Agana',),
 ('Amman',),
 ('Amsterdam',),
 ('Andorra la Vella',),
 ('Antananarivo',)]

## Semi-join and anti-join
![Semi and anti-joins](datasets/semi_and_anti-joins.png)

You are now going to use the concept of a semi-join to identify languages spoken in the Middle East.

In [21]:
%%sql
SELECT DISTINCT name FROM languages
WHERE code IN (SELECT code FROM countries WHERE region = 'Middle East')
ORDER BY name
LIMIT 5;

 * postgresql://root:***@localhost:5432/datacamp_countries
5 rows affected.

[('Arabic',), ('Aramaic',), ('Armenian',), ('Azerbaijani',), ('Azeri',)]

Sometimes problems solved with semi-joins can also be solved using an inner join.

In [22]:
%%sql
SELECT DISTINCT l.name AS language
FROM languages AS l
INNER JOIN countries AS c
    ON l.code = c.code 
WHERE c.region = 'Middle East'
ORDER BY language
LIMIT 5;

 * postgresql://root:***@localhost:5432/datacamp_countries
5 rows affected.

[('Arabic',), ('Aramaic',), ('Armenian',), ('Azerbaijani',), ('Azeri',)]

Identify the country codes that are included in either `economies` or `currencies` but not in `populations`.

Use that result to determine the names of cities in the countries that match the specification in the previous instruction.

In [23]:
%%sql
SELECT name
  FROM cities
  WHERE country_code IN
(
    SELECT e.code
    FROM economies AS e
    UNION
    SELECT c.code
    FROM currencies AS c
    EXCEPT
    SELECT p.country_code
    FROM populations AS p
);

 * postgresql://root:***@localhost:5432/datacamp_countries
6 rows affected.

[('Bucharest',),
 ('Kaohsiung',),
 ('New Taipei City',),
 ('Taichung',),
 ('Tainan',),
 ('Taipei',)]

## Subqueries

Using INNER JOIN and GROUP BY

In [24]:
%%sql
SELECT 
    countries.name AS country, 
    COUNT(*) AS cities_num
  FROM cities
    INNER JOIN countries
    ON countries.code = cities.country_code
GROUP BY country
ORDER BY cities_num DESC, country
LIMIT 5;

 * postgresql://root:***@localhost:5432/datacamp_countries
5 rows affected.

[('China', 36), ('India', 18), ('Japan', 11), ('Brazil', 10), ('Pakistan', 9)]

Using subqueries

In [25]:
%%sql
SELECT 
    name AS country,
    (SELECT COUNT(*)
     FROM cities
     WHERE countries.code = cities.country_code) AS cities_num
FROM countries
ORDER BY cities_num DESC, country
LIMIT 5;

 * postgresql://root:***@localhost:5432/datacamp_countries
5 rows affected.

[('China', 36), ('India', 18), ('Japan', 11), ('Brazil', 10), ('Pakistan', 9)]

In this exercise, for each of the six continents listed in 2015, you'll identify which country had the maximum inflation rate (and how high it was) using multiple subqueries.

In [26]:
%%sql
SELECT name, continent, inflation_rate
FROM countries AS c
INNER JOIN economies AS e
    ON c.code = e.code
WHERE year = 2015
    AND inflation_rate IN (
        SELECT MAX(inflation_rate) AS max_inf
        FROM (
             SELECT continent, inflation_rate
             FROM countries
             INNER JOIN economies
                 ON countries.code = economies.code
             WHERE year = 2015) AS subquery
        GROUP BY continent
    )
ORDER BY inflation_rate DESC;

 * postgresql://root:***@localhost:5432/datacamp_countries
6 rows affected.

[('Venezuela', 'South America', 121.738),
 ('Ukraine', 'Europe', 48.684),
 ('Yemen', 'Asia', 39.403),
 ('Malawi', 'Africa', 21.858),
 ('Nauru', 'Oceania', 9.784),
 ('Haiti', 'North America', 7.524)]

In [27]:
%%sql
-- cannot include name in the result if you don't include it in GROUP BY clause
SELECT name, continent, MAX(inflation_rate) AS max_inf 
FROM (
     SELECT continent, inflation_rate
     FROM countries
     INNER JOIN economies
     ON countries.code = economies.code
     WHERE year = 2015
) AS subquery
GROUP BY continent;

 * postgresql://root:***@localhost:5432/datacamp_countries
(psycopg2.errors.UndefinedColumn) column "name" does not exist
LINE 2: SELECT name, continent, MAX(inflation_rate) AS max_inf
               ^

[SQL: -- cannot include name in the result if you don't include it in GROUP BY clause
SELECT name, continent, MAX(inflation_rate) AS max_inf
FROM (
     SELECT continent, inflation_rate
     FROM countries
     INNER JOIN economies
     ON countries.code = economies.code
     WHERE year = 2015
) AS subquery
GROUP BY continent;]
(Background on this error at: http://sqlalche.me/e/f405)

## Common Table Expressions
Runs only once and then stored in memory

In [28]:
%%sql
WITH max_inflation_rate_per_continent AS (
    SELECT MAX(inflation_rate) AS max_inf
        FROM (
             SELECT continent, inflation_rate
             FROM countries
             INNER JOIN economies
                 ON countries.code = economies.code
             WHERE year = 2015) AS subquery
        GROUP BY continent
),
unused_tmp_table AS (SELECT * FROM countries)

SELECT name, continent, inflation_rate
FROM countries AS c
INNER JOIN economies AS e
    ON c.code = e.code
WHERE year = 2015
    AND inflation_rate IN (SELECT * FROM max_inflation_rate_per_continent)
ORDER BY inflation_rate DESC;

 * postgresql://root:***@localhost:5432/datacamp_countries
6 rows affected.

[('Venezuela', 'South America', 121.738),
 ('Ukraine', 'Europe', 48.684),
 ('Yemen', 'Asia', 39.403),
 ('Malawi', 'Africa', 21.858),
 ('Nauru', 'Oceania', 9.784),
 ('Haiti', 'North America', 7.524)]

# Differentiating Techniques
![Differentiating Techniques](datasets/Differentiating_techniques.png)